# 在控制台中打印如下图形
# ******************
# ******************
# ******************
# ******************
# ******************
# 创建一个循环来控制图形的高度
# 循环嵌套时，外层循环每执行一次，内存循环就要执行一圈
"""i = 0
while i < 5:
    print('******************')
    i += 1"""
"""i = 0
while i < 5:
    # 创建一个内层循环来控制图形的宽度
    j = 0
    while j < 5:
        print('* ', end='')
        j += 1
    print('')
    i += 1"""
i = 0
while i < 5:
    # 创建一个内层循环来控制图形的宽度
    j = 0
    while j <= i:
        print('* ', end='')
        j += 1
    print('')
    i += 1
    