# 创建一个列表
stus = ['孙悟空', '猪八戒', '沙和尚', '唐僧', '蜘蛛精', '白骨精']
print('修改前', stus)
# 修改列表中的元素
# 直接通过索引来修改元素
stus[0] = 'sunwukong'
stus[2] = '哈哈'
print('修改后', stus)
# 通过del来删除元素
# 删除索引为2的元素
del stus[2]
print('修改后', stus)
stus = ['孙悟空', '猪八戒', '沙和尚', '唐僧', '蜘蛛精', '白骨精']
print('修改前', stus)
# 通过切片来修改列表
# 再给切片进行赋值时，只能使用序列
# stus[0:2] = [123]
# stus[0:2] = ['牛魔王', '红孩儿'] # 使用新元素替换旧元素
# stus[0:2] = ['牛魔王', '红孩儿', '铁扇公主', '狐狸精']
# stus[0:0] = ['牛魔王'] # 向索引为0的位置插入元素
# 当设置了步长时，序列中元素的个数必须和切片中元素的个数一致
stus[::2] = ['牛魔王', '红孩儿', '二郎神']
print('修改后', stus)
# 通过切片来删除元素
stus = ['孙悟空', '猪八戒', '沙和尚', '唐僧', '蜘蛛精', '白骨精']
del stus[0:2]
print('修改后', stus)
del stus[::2]
print('修改后', stus)
stus = ['孙悟空', '猪八戒', '沙和尚', '唐僧', '蜘蛛精', '白骨精']
# 删除元素方法二
stus[1:3] = []
print('修改后', stus)
# 以上操作只适用可变序列
s = 'hello'
# 不可变序列无法通过序列来修改 s[1] = 'a'
# 可以通过list（）函数将其他的序列转换为list
s = list(s)
print(s)